# Forest Fires in Brazil(EDA)

In [20]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [21]:
df = pd.read_csv('amazon.csv' , encoding='ISO-8859-1' )

# 1. Display Top 5 Rows of The Dataset

In [24]:
df.head()

   year state    month  number        date
0  1998  Acre  Janeiro     0.0  1998-01-01
1  1999  Acre  Janeiro     0.0  1999-01-01
2  2000  Acre  Janeiro     0.0  2000-01-01
3  2001  Acre  Janeiro     0.0  2001-01-01
4  2002  Acre  Janeiro     0.0  2002-01-01

# 2. Check Last 5 Rows

In [25]:
df.tail()

      year      state     month  number        date
6449  2012  Tocantins  Dezembro   128.0  2012-01-01
6450  2013  Tocantins  Dezembro    85.0  2013-01-01
6451  2014  Tocantins  Dezembro   223.0  2014-01-01
6452  2015  Tocantins  Dezembro   373.0  2015-01-01
6453  2016  Tocantins  Dezembro   119.0  2016-01-01

# 3. Find Shape of Our Dataset (Number of Rows And Number of Columns)

In [26]:
df.shape

(6454, 5)

In [27]:
print("number of rows are :",df.shape[0])
print("number of columns are :" , df.shape[1])

number of rows are : 6454
number of columns are : 5

# 4. Getting Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column And Memory Requirement

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6454 non-null   int64
 1   state   6454 non-null   object
 2   month   6454 non-null   object
 3   number  6454 non-null   float64
 4   date    6454 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 252.2+ KB

#  5. Check For Duplicate Data and Drop Them

In [29]:
df.duplicated().any()

np.True_

In [34]:
df1=df.drop_duplicates()

In [35]:
df1.duplicated().any()

np.False_

# 6. Check Null Values In The Dataset

In [37]:
df.isnull().values.any()

np.False_

In [38]:
df.isnull().sum()

year      0
state     0
month     0
number    0
date      0
dtype: int64

In [45]:
df['date'].unique()

array(['1998-01-01', '1999-01-01', '2000-01-01', '2001-01-01',
       '2002-01-01', '2003-01-01', '2004-01-01', '2005-01-01',
       '2006-01-01', '2007-01-01', '2008-01-01', '2009-01-01',
       '2010-01-01', '2011-01-01', '2012-01-01', '2013-01-01',
       '2014-01-01', '2015-01-01', '2016-01-01', '2017-01-01'],
      dtype=object)

# 7. Get Overall Statistics About The Dataframe

In [46]:
df.describe()

              year       number
count  6454.000000  6454.000000
mean   2007.461729   108.293163
std       5.746654   190.812242
min    1998.000000     0.000000
25%    2002.000000     3.000000
50%    2007.000000    24.000000
75%    2012.000000   113.000000
max    2017.000000   998.000000

# 8. Rename Month Names To English

In [49]:
df['month'].unique()

array(['Janeiro', 'Fevereiro', 'Março', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype=object)

In [56]:
df['new_month']= df['month'].map({'Janeiro' : 'January','Fevereiro' :'February','Março' :'March','Abril' :'April','Maio' :'May','Junho' : 'June','Julho' : 'July','Agosto' : 'Augest','Setembro' : 'September','Outubro' : 'October','Novembro' : 'November','Dezembro' : 'December'})

In [57]:
df

      year      state     month  number        date new_month
0     1998       Acre   Janeiro     0.0  1998-01-01   January
1     1999       Acre   Janeiro     0.0  1999-01-01   January
2     2000       Acre   Janeiro     0.0  2000-01-01   January
3     2001       Acre   Janeiro     0.0  2001-01-01   January
4     2002       Acre   Janeiro     0.0  2002-01-01   January
...    ...        ...       ...     ...         ...       ...
6449  2012  Tocantins  Dezembro   128.0  2012-01-01  December
6450  2013  Tocantins  Dezembro    85.0  2013-01-01  December
6451  2014  Tocantins  Dezembro   223.0  2014-01-01  December
6452  2015  Tocantins  Dezembro   373.0  2015-01-01  December
6453  2016  Tocantins  Dezembro   119.0  2016-01-01  December

[6454 rows x 6 columns]

# 9. Total Number of Fires Registered

In [58]:
df.columns

Index(['year', 'state', 'month', 'number', 'date', 'new_month'], dtype='object')

In [61]:
df.shape

(6454, 6)

# 10. In Which Month Maximum Number of Forest Fires Were Reported?

In [62]:
df.columns

Index(['year', 'state', 'month', 'number', 'date', 'new_month'], dtype='object')

In [65]:
df.groupby('new_month')['number'].max().sort_values(ascending  = False)

new_month
September    998.0
Augest       995.0
November     995.0
July         989.0
June         979.0
October      964.0
January      960.0
December     956.0
April        947.0
May          942.0
February     871.0
March        820.0
Name: number, dtype: float64

# 11. In Which Year Maximum Number of Forest Fires Was Reported?

In [66]:
df.columns

Index(['year', 'state', 'month', 'number', 'date', 'new_month'], dtype='object')

In [69]:
df.groupby('year')['number'].max().sort_values(ascending = False)

year
2008    998.0
2006    995.0
2012    995.0
2009    989.0
2017    987.0
2007    982.0
1999    982.0
2001    979.0
2003    977.0
2002    976.0
2011    974.0
2016    969.0
2015    960.0
2004    960.0
2013    956.0
2014    952.0
2005    948.0
2010    941.0
2000    925.0
1998    875.0
Name: number, dtype: float64

# 12. In Which State Maximum Number of Forest Fires Was Reported?

In [70]:
df.columns

Index(['year', 'state', 'month', 'number', 'date', 'new_month'], dtype='object')

In [72]:
df.groupby('state')['number'].max().sort_values(ascending = False)

state
Amazonas            998.0
Bahia               995.0
Ceara               995.0
Tocantins           989.0
Paraiba             987.0
Pará                982.0
Sao Paulo           981.0
Mato Grosso         979.0
Maranhao            972.0
Rondonia            969.0
Amapa               969.0
Acre                960.0
Minas Gerais        959.0
Goias               943.0
Piau                943.0
Rio                 885.0
Pernambuco          859.0
Roraima             820.0
Santa Catarina      765.0
Espirito Santo      307.0
Sergipe             198.0
Distrito Federal    196.0
Alagoas             162.0
Name: number, dtype: float64

# 13. Find Total Number of Fires Were Reported In Amazonas

In [77]:
df[df['state'] == 'Amazonas'] ['number'].sum()

np.float64(30650.129)

# 14. Display Number of Fires Were Reported In Amazonas (Year-Wise)

In [78]:
df.columns

Index(['year', 'state', 'month', 'number', 'date', 'new_month'], dtype='object')

In [83]:
df1 = df[df['state'] == 'Amazonas'] [['year' , 'number']]

In [84]:
df1.groupby('year')['number'].sum()

year
1998     946.000
1999    1061.000
2000     853.000
2001    1297.000
2002    2852.000
2003    1524.268
2004    2298.207
2005    1657.128
2006     997.640
2007     589.601
2008    2717.000
2009    1320.601
2010    2324.508
2011    1652.538
2012    1110.641
2013     905.217
2014    2385.909
2015    1189.994
2016    2060.972
2017     906.905
Name: number, dtype: float64

# 15. Display Number of Fires Were Reported In Amazonas (Day-Wise)

In [87]:
df1 = df[df['state'] == 'Amazonas'] [['date' , 'number']]

In [ ]:
df1.groupby('date')[]

# 16. Find Total Number of Fires  Were Reported In 2015 And Visualize Data Based on Each ‘Month’

# 17. Find Average Number of Fires Were Reported From Highest to Lowest (State-Wise)

# 18.  To Find The State Names Where Fires Were Reported In 'dec' Month